app/controllers/password_resets_controller.rb

  def create
  	# We first put the Active Record row we are looking at (email:), then
  	#we specific details from the form (called password_reset), with one form
  	#field being emails, which is what we are looking at
  	@user=User.find_by(email:params[:password_reset][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "asdfewr@gmail.com"], ["LIMIT", 1]]