app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    #Index takes in this instance variable, based on the page selects what users to display
    @users = User.paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  	#automatically has an id from the URL (the number after users is the id)
  	@user = User.find(params[:id])